Autodesk.Revit.Attributes.TransactionAttribute.Mode
Transaction mode.
Since: 2011

Autodesk.Revit.Attributes.TransactionAttribute.#ctor(Autodesk.Revit.Attributes.TransactionMode)
Constructs a new TransactionAttribute.
Since: 2011

Autodesk.Revit.Attributes.TransactionAttribute
The custom transaction attribute to control the transaction behavior of the external command.
Since: 2011